Revit 2026 API

# BuiltInFailuresMechanicalFailures Class

---

Failures about HVAC.

SystemObject Autodesk.Revit.DBBuiltInFailuresMechanicalFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class MechanicalFailures
```
```vb
Public NotInheritable Class MechanicalFailures
```
```cpp
public ref class MechanicalFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MechanicalFailures = class end
```

The BuiltInFailuresMechanicalFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InitialEqualFrictionSizingFailed | Initial Equal Friction Sizing failed. |
|  | LiningThicknessIsLargeForDiameter | Lining Thickness ([Lining Thickness Value]) is too large for current Diameter ([Diameter Value]). |
|  | LiningThicknessIsLargeForHeight | Lining Thickness ([Lining Thickness Value]) is too large for current Height ([Height Value]). |
|  | LiningThicknessIsLargeForWidth | Lining Thickness ([Lining Thickness Value]) is too large for current Width ([Width Value]). |
|  | PanelDoesntMatchCircuitProperties | The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit? |
|  | PanelValidateConfigurationError | More than one circuit falls onto the same slot. Disconnect the circuits from the panel? |
|  | TwoPointsSelectedBeforeEdit | Two points have to be selected before existing the edit mode. |

#### Reference

Autodesk.Revit.DB Namespace